Revit 2027 API
ShapeImporter Constructor
 Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ShapeImporter()
Public Sub New
public:
ShapeImporter()
new : unit -> ShapeImporter
See Also
Reference
ShapeImporter Class
Autodesk.Revit.DB Namespace